!
$
%
&
'
''
'86
'Boogie
'Greek
'Splash
'The
'Wolves
'big
'd
'll
're
's
've
(
)
+/
,
,104
,109
,111
,117
-
.
..
.190
.500
.508/.455/.912
.6
.8
.911
.On
0
00
0:1
0:10
0:16
0:29
0:34
0:39
0:48
1
1,0
1,245
1,400
1,600th
1,787th
10
100
1000th
101
102
103
104
105
106
107
108
109
1099th
10:12
10:21
10:22
10:30
10:53
10th
10tth
11
110
111
112
113
114
115
116
117
118
119
11th
12
12..
120
121
122
123
124
124th
125
126
127
128
128th
129
12:30
12th
13
13,0th
130
131
132
133
134
135
136
137
138
139
13th
14
140
141
142
143
144
147
148
149
14th
15
15/26
150
155th
156
157
159
15FG
15th
16
160
161
162
168
16th
17
17+
170
173
177
17th
18
180
184
187
189
18th
19
190
192
193
195
1951
1952
1954
1963/64
1969
1970
1971
1973
1974
1975
1978
1980
1985
1988
1989
1991
1992
1993
1994
1995
1997
1998
19990
19th
1:0
1:10
1:12
1:14
1:15
1:16
1:18
1:19
1:20
1:21
1:23
1:25
1:28
1:30
1:31
1:32
1:34
1:35
1:36
1:37
1:38
1:39
1:40
1:42
1:43
1:44
1:46
1:47
1:49
1:5
1:50
1:51
1:52
1:54
1:55
1:7
1:8
1FT
1st
1’s
2
2,720
2,887
2/19
20
20+
20/20
200
2001
2002
2004
2005
2006
2007
2008
2009
200th
2010
2010s
2011
2012
2013
2014
2015
2016
2017
20:46
20:54
20s
20th
21
210
215th
216
21FG
21in
21st
22
220
223
22:42
22nd
23
230
23:43
23rd
24
240
241
249
24th
25
251
252
253
254
259
25th
26
26.The
260
261
262
266
26th
27
27,0
273
27th
28
28,0
28,609
280
281
28th
29
29,0
290
29:14
29th
2:0
2:10
2:11
2:14
2:15
2:21
2:23
2:28
2:3
2:30
2:32
2:33
2:35
2:37
2:39
2:40
2:45
2:5
2:50
2:54
2:56
2:59
2:8
2:9
2FT
2nd
3
30
30,0
300
30s
30th
31
31.
310
31st
32
32:8
32nd
33
339
33rd
34
34th
35
35+
35th
36
360
366
36th
37
37.Turnovers
370
37:53
37th
38
38/29/72
38:33
38th
39
39th
3:0
3:12
3:13
3:15
3:19
3:2
3:20
3:22
3:26
3:29
3:3
3:30
3:31
3:32
3:36
3:4
3:40
3:43
3:44
3:47
3:48
3:54
3:55
3:56
3:58
3:9
3FT
3PM
3PT
3Pt
3Pt,1
3Pts
3pt
3rd
4
40
40+
40th
41
41st
42
42nd
43
43:16
44
44th
45
45th
46
47
47th
48
48th
49
497
4:0
4:11
4:13
4:18
4:20
4:21
4:24
4:25
4:3
4:30
4:31
4:33
4:34
4:40
4:46
4:5
4:50
4:52
4:54
4:8
4:9
4Pt
4`.The
4th
5
5'9
50
50+
50,0
50/50
500th
502
50th
51
510
51st
52
52nd
53
53rd
54
55
56
57
570
58
59
5:0
5:12
5:13
5:15
5:16
5:22
5:31
5:33
5:40
5:43
5:45
5:47
5:50
5:54
5:55
5:56
5:9
5x5
5’8”
6
6,25
60
60th
61
61st
62
62nd
63
64
64th
65
66
67
68
69
6:11
6:13
6:24
6:26
6:30
6:37
6:39
6:40
6:41
6:43
6:45
6:5
6:52
6:53
6:56
6:58
6ers
6th
7
7/18
70
71
71st
72
73
73rd
74
75
76
76er
76ers
76ers,104
76ers’
77
78
79
7:0
7:13
7:24
7:26
7:27
7:28
7:30
7:31
7:35
7:37
7:38
7:40
7:43
7:50
7:58
7FT
7th
8
8.The
80
80s
81
82
83
84
85
850
86
866th
87
879th
88
89
8:0
8:1
8:26
8:27
8:30
8:38
8:40
8:42
8:56
8th
9
9/18
90
90s
90’s
91
919
92
921
93
94
94.The
95
95..
96
97
98
99
9:0
9:15
9:26
9:28
9:30
9:4
9th
:
:1
:10
:15
:2
:20
:22
:23
:25
:27
:3
:30
:34
:36
:43
:48
:5
:6
;
A
A-game
A.J
AC
ACL
AT
Aaron
Abdul-Jabar
Above
Abrines
Abysmal
According
Accordingly
Accuracy
Achilles
Achillies
Across
Acy
Adams
Add
Adding
Additionally
Adreian
Affalo
Afflalo
Afflalo’s
After
Afternoon
Again
Against
Aging
Air
AirCanada
Airlines
Airways
Ajinca
Al
Al-Farouq
Al-Forouq
Alan
Aldemir
Aldrich
Aldridge
Aldridge’s
Aldrige
Alec
Alex
Alexey
Alexis
All
All-Defense
All-NBA
All-Rookie
All-Star
All-Star-caliber
All-Stars
All-star
Allen
Almost
Along
Alongside
Alonzo
Already
Also
Altanta
Although
Altogether
Alvin
Amar'e
Amare
Amar’e
Amazingly
America
American
AmericanAirlines
Amidst
Aminiu
Aminu
Aminu’s
Amir
Among
Amundson
Amway
An
Anchoring
And
Andersen
Anderson
Anderson’s
Andre
Andrea
Andrei
Andrew
Andrews
Angeles
Angeles’
Angels
Angles
Anjinca
Another
Antentokounmpo
Antetekoumpo
Antetenkoumpo
Antetkokounmpo
Antetokonmpo
Antetokoumpo
Antetokounmpo
Antetokunmpo
Antetotkoumpo
Anthony
Anthony-Towns
Anthony’s
Antic
Antonino
Antonio
Antonio’s
Antony
Any
Apple
Apr
April
Archie
Area
Arena
Argentina
Argentinian
Arguably
Arinze
Ariza
Ariza’s
Arizona
Aron
Arron
Arthur
Artis
As
Aside
Asik
Association
At
Atlanta
Atlanta’s
Atlantic
Atonio
Auburn
Augustin
Aussie
Austin
Australian
Averaging
Avery
Award
Ayres
B-squad
B-team
B-unit
BMO
Babbit
Babbitt
Back
Back-to-back
Backcourt
Backup
Baker
Ball
Banker
Bankers
Barack
Barbosa
Barbosa’s
Barclay
Barclays
Barea
Bargnani
Barnes
Baron
Barron
Barton
Barton’s
Basketball
Baskets
Bass
Bass’
Batman
Battling
Batum
Bay
Bayless
Baynes
Bazemore
Bazmore
Beal
Beal-less
Beal’s
Beantown
Beard
Beasley
Beasley’s
Because
Before
Began
Behind
Believe
Belinelli
Bellinelli
Bembry
Ben
Bench
Bender
Bennet
Bennett
Beno
Bernard
Bertans
Besides
Best
Between
Beverely
Beverley
Beverly
Beyond
Bickerstaff
Big
Billy
Bird
Bismack
Biyombo
Bjelica
Black
Blair
Blake
Blatt
Blaylock
Blazer
Blazers
Blazers’
Blazer’s
Bledsoe
Bledsoe’s
Blowout
Blue
Boba
Boban
Bobby
Boganovic
Bogdan
Bogdanovic
Bogdanovich
Bogdonavic
Bogut
Bogut’s
Bojan
Bonner
Boogie
Booker
Boozer
Boris
Borrego
Bosh
Bosh’s
Boston
Boston’s
Both
Bouncing
Bowl
Bowl-esque
Boxing
Boy
Brad
Bradely
Bradley
Bradley’s
Brand
Brandan
Brandon
Brazilian
Break
Breakout
Brett
Brewer
Brian
Briante
Brodgon
Brogdon
Brook
Brooklyn
Brooklyn’s
Brooks
Broonlyn
Broooklyn
Bros
Bros.
Brother
Brothers
Brow
Brown
Bruno
Brussino
Bryant
Bryant’s
Bryce
Bston
Buck
Buckets
Bucks
Bucks’
Bud
Buddy
Budenholzer
Budenholzer-coached
Budinger
Bull
Bulldogs
Bullets
Bullock
Bulls
Bulls-Jazz
Bulls/Bucks
Bulls’
Burke
Burkes
Burks
But
Butler
Buttressed
Buycks
By
Bynum
Byron
C
C.
C.J
CA
CJ
Caanan
Cable
Caboclo
Calathes
Calderon
Calderon-the
Caldwell
Caldwell-Pope
Caldwell-Pope’s
California
Cameron
Cameroon
Canaan
Canada
Canade
Candidate
Canter
Capela
Capela’s
Capital
Capitalizing
Caplea
Cappella
Careful
Caris
Carl
Carlisle
Carlos
Carmel
Carmelo
Carolina
Caron
Carrol
Carroll
Carter
Carter-Williams
Carter-Williams’
Casey
Caspi
Casspi
Casspi’s
Castillo
Cater
Cauley-Stein
Cavalier
Cavaliers
Cavliers
Cavs
Cavs’
Celeveland
Celitcs
Celtic
Celtices
Celtics
Celtics-Hawks
Celtics’
Center
Central
Central-Division
Centre
Cetlics
Challenge
Chalmers
Chamberlain
Chamberlain-esque
Champions
Championship
Chander
Chandle
Chandler
Chandler’s
Channing
Charles
Charlie
Charlotte
Charlotte’s
Chase
Chasson
Cheick
Chesapeake
Chicago
Chicago’s
Chicgo
Chinese
Chipping
Chirs
Chris
Chriss
Christmas
Christon
Christopher
Cincinnati
Cippers
City
City’s
Clark
Clarkson
Clarkson-Williams
Clarkson’s
Cleanthony
Clearly
Cleavland
Clevelad
Cleveland
Cleveland-Golden
Cleveland’s
Clifford
Clint
Clipper
Clippers
Clippers-Suns
Clippers.com
Clippers/San
Clippers’
Clips
Close
Co.
Coach
Coast
Coast-bound
Cody
Coference
Coincidentally
Cole
Collectively
Collision
Collison
Colorado
Combine
Combined
Comeback
Coming
Committing
Compared
Competition
Conely
Conference
Conference-leading
Conferences
Conference’s
Confined
Confronted
Conley
Conley’s
Considering
Containing
Contest
Continuing
Contrarily
Conventional
Conversely
Convington
Copeland
Corbin
Corey
Cory
Cotton
Coupled
Courtesy
Courtney
Cousin
Cousin-less
Cousins
Cousins'game-high
Cousins’
Cousin’s
Covering
Covington
Covington’s
Crabbe
Crabbed
Crawford
Crawford’s
Creighton
Crey
Cristiano
Croatian
Croation
Crowder
Cs
Cunningham
Curry
Curry-Thompson
Curry-less
Curry’s
Cwas
C’s
D'Angelo
D'Antoni
D'Antoni-led
D-League
D-league
D.
D.C
D.C.
D.J
DC
DCP-CD
DCP-CDs
DJ
DNP
DNP-CD
DNP-CDs
DNP-rest
DUI
Dahntay
Dalembert
Dalemebert
Dallas
Dallas’
Damian
Damien
Damjan
Daniels
Danillo
Danilo
Danny
Dante
Dargic
Dario
Darius
Darrell
Darren
Darrren
Darrun
Dating
Datome
Dave
David
Davies
Davis
Davis’
Day
Daye
Daylight
DeAndre
DeAndreJordan
DeJuan
DeMar
DeMarcus
DeMare
DeMarre
DeRozan
DeRozean
Deandre
Death
Dec.
December
Decimated
Dedmon
Deep
Defense
Defensive
Defensively
Dejean-Jones
Dejounte
Dejuan
Dekker
Delaney
Delavedova
Dell
Delladedova
Delladova
Dellavadova
Dellavedova
Dellavedova-led
Dellavedova’s
Dellevadova
Delon
Demarre
Demmare
Deng
Denis
Dennis
Denver
Denver’s
Denzel
Depite
Depth
Derek
Derick
Deroan
Deron
Derozan
Derren
Derrick
Despire
Despite
Detroit
Detroit’s
Developing
Devil
Devin
Devner
Dewayne
Dewyane
Deyonta
Diallo
Diaw
Dieng
Dinwiddie
Dion
Dirk
Division
Division.They
Divison
Divsion
Do
Doc
Doing
Dolan
Domantas
Dominant
Dominating
Dominique
Donald
Donatas
Donovan
Donovan’s
Donte
Doors
Dorell
Dorian
Dorsey
Double
Double-digit
Double-double
Double-doubles
Doug
Douglas
Douglas-Roberts
Douglas’
Down
Dr.
DrRozan
Draft
Dragan
Dragic
Dragic’s
Drama
Draymond
Drazen
Drew
Drummond
Drummond’s
Duantless
Dubs
Dudley
Due
Duke
Duncan
Duncan-less
Duncan’s
Dunk
Dunleavy
Dunn
Duo
Duran
Durant
Durant-Curry
Durant-Westbrook
Durant’s
During
Dwane
Dwayne
Dwight
Dwyane
Dynamic
D’Angelo
E'Twaun
E'Twuan
E'twaun
ESPN
EST
EX
Each
Earl
Earlier
Early
Earth
East
East-leading
Easter
Eastern
Eastern-Conference
Easy
Eatern
Ed
Eddie
Efficiency
Efficient
Eflrid
Eight
Eighth
Eleven
Elfird
Elfrid
Eliis
Elijah
Elite
Ellington
Elliot
Ellis
Ellis’
Elton
Emanuel
Embiid
Emerging
Emmanuel
Empire
Encouragingly
Energy
EnergySolutions
Enes
England
Ennis
Enter
Entering
Equally
Eric
Erick
Erik
Ersan
Especially
Etwaun
Euro
Euroleague
European
Evan
Evans
Evans’
Eve
Even
Evens
Ever
Everdeen
Every
Everyone
Everything
Ex
Excellent
Experiment
Exploding
Exum
Ezeli
FG
FG,4-10
FGM
FGM-A
FT
Facing
Factoring
Falling
Famer
Fans
Fareid
Fargo
Faried
Faried’s
Farmar
Farouq
Fastbreak
Fatigue
Favors
Favors-like
Favors’
Favours
Feb
Feb.
February
Fed
FedEX
FedEx
FedExForum
Fee-throw
Felder
Felicio
Fellow
Felton
Felton’s
Ferrell
Festus
Few
Fg
Field
Fieldhouse
Fields
Fighting
Fill-in
Filling
Final
Finally
Finals
Finals’
Finney-Smith
First
First-round
First-time
First-year
Fisher
Fittingly
Five
Fizdale
Flagrant
Flip
Florida
Followill
Following
For
Forest
Former
Fortunately
Forum
Forward
Forwards
Foul
Four
Four-fifths
Fouriner
Fournier
Fournier’s
Fourth
Fourth-year
Foye
Foye’s
Francisco
Frank
Frazier
Freak
Fred
Fredette
Free
Free-throw
Free-throws
Freeland
French
Frenchman
Frenchmen
Fresh
Fresno
Friday
Friday’s
From
Frontcourt
Frustration
Frye
Ft
Fundamental
Furkan
Further
Future
GM
Gal
Galinari
Gallinari
Gallinari’s
Galloway
Gama
Game
Games
Gaol
Garbage
Garcia
Garden
Garnet
Garnett
Garret
Garrett
Gary
Gasol
Gasol-led
Gasol’s
Gay
Gee
Gentry’s
George
Georgetown
George’s
Georgia
Georgian
Georgios
Gerald
German
Germany
Getting
Gianni
Giannis
Gibson
Giffin
Gilchrist
Gilmore
Ginobili
Ginobli
Given
Giving
Glen
Glenn
Gobert
Going
Golden
Gooden
Gooden’s
Goodwin
Goodwin’s
Goran
Gorat
Gordan
Gordon
Gorgui
Gortat
Gortat’s
Gragic
Granger
Grant
Granted
Gras
Gree
Greek
Green
Greene
Greene’s
Green’s
Greg
Gregg
Greivis
Griffin
Griffin’s
Grind
Grit
Griz
Grizz
Grizzles
Grizzlie
Grizzlies
Grizzlies,104-101
Grizzlies-Blazers
Grizzlies-Heat
Grizzlies-Train
Grizzlies’
Grogui
Guard
Guards
Gueroge
Guillermo
Gundy
Gutierrez
Guy
HIs
HOrnets
Hack
Hack-A-Rocket
Hack-A-Shaq
Hack-a-Drummond
Hairston
Hakeem
Hakws
Half
Hall
Hall-of-Famer
Halloween
Hamilton
Hansbrough
Haradaway
Hardan
Hardaway
Harden
Harden’s
Hardway
Hariston
Harkless
Harrell
Harries
Harris
Harrison
Hasan
Haslem
Hassan
Having
Hawes
Hawk
Hawks
Hawks-Wizards
Hawks/Brooklyn
Hawks’
Hayward
Hayward’s
He
Head
Headed
Heading
Heat
Heat-Los
Heats
Heat’s
Hedo
Heild
Heinrich
Helping
Hendersen
Henderson
Henderson’s
Henry
Henson
Herangomez
Herculean
Hereford
Hernangomez
Hernangonez
Hey
Heyward
Hezonja
He’d
He’s
Hibbert
Hibbert’s
Hibert
Hickson
Hield
High-profile
High-scoring
Highly-publicized
Highly-touted
Hilario
Hill
Hillard
Hilliard
Hills
Hinrich
Hinrich-Aaron
His
History
Hitting
Hoford
Hoiberg
Holiday
Holiday’s
Holiis-Jefferson
Holliday
Hollins
Hollis
Hollis-Jefferson
Hollis-Jefferson’s
Holmes
Home
Honda
Hood
Hoot
Hopefully
Horford
Horford’s
Hornacek
Hornet
Hornets
Hornets-Knicks
Hosting
House
Houston
Houston’s
Howard
However
Hubert
Huertas
Hummel
Humphries
Hunt
Hunter
Huskie
Hyde
II
III
IQ
ISO
IV
Ian
Ibaka
Ibuprofen
Idiana
If
Iguodala
Iguodala’s
Iguodola
Illinois
Ilyasov
Ilyasova
Ilysova
Iman
Impending
Impressive
Impressively
Improved
In
Including
Indiana
Indianapolis
Indiana’s
Info
Ingles
Inglis
Ingram
Inidana
Initial
Injuries
Instead
Interestingly
Interior
Into
Iriving
Irivng
Iron
Ironically
Irving
Irving’s
Isaiah
Ish
Isiah
It
It’ll
It’s
Ivan
Ivica
J
J.
J.B.
J.J
J.J.
J.R
J.R.
JJ
JR
JaKarr
JaMychal
JaVale
Jabari
Jack
Jacksom
Jackson
Jackson’s
Jae
Jahil
Jahlik
Jahlil
Jakaar
Jakarr
Jake
Jakob
Jamaal
Jamal
Jame
Jameer
James
James-esque
James-led
James’
Jan
Jan.
Jan.28
Jannero
January
Jared
Jarell
Jarrell
Jarret
Jarrett
Jarrrett
Jarryd
Jason
Javale
Jaylen
Jazz
Jazz’s
JeBron
Jeff
Jefferson
Jefferson’s
Jekyll
Jenkins
Jennings
Jeoffrey
Jerami
Jerebko
Jeremi
Jeremies
Jeremy
Jerian
Jerome
Jerrett
Jerry
Jerryd
Jersey
Jimmer
Jimmy
Joakim
Jodie
Joe
Joel
Joerger
Joerger’s
Joey
Joffrey
John
Johnathan
Johnny
Johnson
Johnson’s
Joining
Jokic
Jon
Jonas
Jonathan
Jonathon
Jones
Jonson
Jordan
Jordan-Kobe
Jordan’s
Jordan”
Jorge
Jose
Joseph
Josh
Journeyman
Jr
Jr.
Jrue
Jr’s
Juan
Juancho
Judging
Julius
Juluis
July
June
Juno
Jusf
Just
Justice
Justin
Justise
Jusuf
K.J
K.J.McDaniels
KCP
KD
KJ
Kaman
Kaminksy
Kaminsky
Kansas
Kanter
Kanter’s
Karasev
Kareem
Karl
Karl-Anthony
Karl’s
Katniss
Kavner
Kawhi
Kay
Keep
Keeping
Kelly
Kelvin
Kemba
Kendall
Kendrick
Kenneth
Kennth
Kent
Kentavious
Kentavius
Kentucky
Kenyon
Kerr
Kerr’s
Kevin
Kevon
Key
Khris
Kicks
Kidd
Kidd-Gilchrist
Kidd-Gilcrhist
Kigs
Kilpatrick
Kilpatrick’s
Kilpatrtick
King
Kings
Kings-Grizzlies
Kings’
Kirilenko
Kirk
Klay
Knick
Knicks
Knicks’
Knight
Knight-led
Knight’s
Knowing
Kobe
Kobe-less
Korver
Korver’s
Kosta
Kostas
Koufos
Kris
Kristaps
Kurt
Kuzminskas
Kyle
Kyler
Kyrie
L.A.
L2M
LA
LAC
LIllard
La-La
LaMarcus
LaVert
LaVine
LaVoy
Labissiere
Lacking
Lackluster
Lady
Lake
Laker
Lakers
Lakers,116-92
Lakers-Hawks
Lakers.The
Lakers’
Lamarcus
Lamb
Lance
Land
Landry
Langston
Largely
Larkers
Larkin
Larry
Last
Lastly
Late
Latvian
Lauvergne
Lavine
Lavoy
Lawson
Layman
LeAndro
LeBron
LeBron-less
LeVert
LeVine
Leading
League-leading
Leagues
Leandro
Leaondro
Lebron
Led
Ledo
Lee
Lehigh
Len
Len’s
Leoanrd
Leonard
Leonard’s
Leuer
Levert
Levine
Lewis
Life
Liggins
Like
Likely
Likewise
Lillard
Lillard-less
Lillard-like
Lillards
Lillard’s
Lim
Limiting
Lin
Lionel
Little
Livingston
Livingston’s
Loans
London
Lone
Long
Long-range
Long-time
Look
Looking
Looney
Lopez
Lopez’s
Lopsided
Los
Losers
Losing
Losses
Lost
Lottery
Lou
Louis
Louisville
Love
Love-like
Love/Olynyk
Loves
Low
Lowry
Lowry-less
Lowry’s
Luc
Lucas
Luck
Luckily
Lue
Luigi
Luis
Luke
Luol
Luther
Luwawu-Cabarrot
Luwawu-Cabbarot
Lyles
M
MCL
MCW
MEMPHIS
MIami
MIllsap
MIlwaukee
MIrotic
MKG
MLK
MRI
MVP
MVP-caliber
MVP-candidate
MVP-level
MVP-like
MVP-type
MVPs
MVP’s
MacCollum
Mack
Mack’s
Made
Madison
Magic
Magics
Magic’s
Mahimi
Mahinmi
Mahinmi’s
Mainstay
Maker
Making
Malachi
Malcolm
Malone
Mamba
Man
Manhattan
Manimal
Manimal”
Manu
Many
Mar
Marble
Marc
Marcelo
March
Marcin
Marco
Marcus
Mardi
Mareese
Marieff
Marin
Mario
Marion
Marjanovic
Mark
Markeiff
Markel
Markief
Markieff
Marquese
Marquette
Marreese
Marresse
Marshall
Martell
Martin
Marvin
Maryland
Mason
Matching
Matchup
Mathew
Mathews
Matt
Matthew
Matthews
Matthews’
Maurice
Maverick
Mavericks
Mavericks-Clippers
Mavericks’
Mavs
May
Mayo
Mbah
McBuckets
McCallum
McCaw
McClellan
McCollum
McCollum’s
McConnell
McCrae
McCullough
McDaniels
McDermott
McGary
McGee
McGruder
McHale
McLemore
McMillan
McRae
McRoberts
Mclemore
Meager
Meanwhile
Meawhile
Medical
Meeks
Mejri
Mekel
Melo
Meltdowns
Melvin
Memphihs
Memphis
Memphis’
Metta
Mexico
Meyers
Miami
Miami’s
Michael
Michael-Carter
Michael-McAdoo
Michigan
Mid-season
Middleton
Midseason
Midway
Midwest
Mighty
Mike
Mikey
Miles
Miles’
Miller
Mills
Millsap
Millsap’s
Milsap
Milwaukee
Milwaukee’s
Milwuakee
Mindaugas
Mindauguas
Mindaugus
Mini-Manimal
Minimal
Minneapolis
Minnesota
Minnesota’s
Minny
Minutes
Mired
Mirotic
Mirza
Mitch
Mitchell
Mitotic
Mo
Moda
Monday
Mondays
Monday’s
Monroe
Monta
Montero
Month
Montiejunas
Montijunas
Montrezl
Monty
Mookie
Moon
Moore
More
Moreland
Moreover
Morris
Morriss
Morro
Morrow
Most
Motiejunas
Motiejunas’
Motor
Motown
Moute
Moving
Mozgov
Much
Mudiay
Muhammad
Muhammad’s
Muhammed
Muiday
Multiple
Murray
Muscala
My
Myers
Myles
NBA
NBA-best
NBA-high
NBA-issued
NBA-leading
NBA-ready
NBA-record
NBA/ABA
NBA’s
NCAA
NIkola
Nance
Napier
Nash
Nate
Nation
National
Naturally
Neal
Near
Nearing
Nearly
Nearng
Needless
Neither
Nelson
Nemana
Nemanja
Nemenja
Nene
Neophytes
Nerlen
Nerlends
Nerlens
Net
Neto
Nets
Nets’
Never
Nevertheless
New
Newcomer
Newest
Newly
Newly-acquired
Newly-minted
Next
Nic
Nicholas
Nicholson
Nick
Nicola
Nicolas
Night
Nights
Nik
Nike
Nikola
Nine
No
No.1
Noah
Nobody
Noel
Nogeira
Nogueira
None
Nonetheless
Normally
Norman
Norris
North
Northeast
Northern
Northwest
Northwestern
Not
Notable
Notably
Notching
Nothing
Nov.
Novak
November
Now
Nowitzk
Nowitzki
Nowitzki-led
Nowiztki
Nowtizki
Nugget
Nuggets
Nuggets-Timberwolves
Nuggets’
Nugggets
Nugs
Numbers
Nurkic
O
O'Bryant
O'Neal
O'Quinn
O.J
O.T.
O2
OJ
OK
OKC
ORACLE
OT
Oakland
Oakley
Obama
Ochsner
Oct.
October
Oddly
Of
Off
Offense
Offensive
Offensively
Offseason
Often
Okafor
Okafor’s
Okakor
Okaro
Okdafor
Oklahoma
Oklahpma
Oladipo
Oladipo-less
Oladipo’s
Olajuwon
Olynk
Olynyk
Omar
Omer
Omri
On
Once
One
Only
Onuaku
Opening
Operations
Opposed
Opposing
Oracle
Orando
Oregon
Oreleans
Orlando
Orlando’s
Orlean
Orleans
Orleans’
Oscar
Other
Otto
Oubre
Out
Outside
Over
Overall
Overshadowed
Overtime
Over”
O’Quinn
P.J
P.J.Tucker
P.M.
PER
PF
PG
PIstons
PJ
PM
PR
Pablo
Pacer
Pacers
Pacers’
Pachulia
Pachulia’s
Pacific
Palace
Papagiannis
Papanikolaou
Pargo
Parker
Parker’s
Parson
Parsons
Part
Partner
Pascal
Pasrsons
Patrick
Patrick’s
Patterson
Patty
Pau
Paul
Paul’s
Payne
Payton
Peace
Peach
Pekovic
Pelican
Pelicans
Pelicans’
Pels
Penn
Pepsi
Per
Perennial
Perennially
Performances
Perhaps
Perimeter
Perkins
Pero
Perry
Personal
Peterson
Petrovic
Phenom
Pheonix
Phil
Philadelhpia
Philadelphia
Philadelphia-Atlanta
Philadelphia’s
Philadelphis
Philadelpia
Philadephia
Philadlephia
Phili
Philidelphia
Philips
Phillips
Philly
Phoenix
Phoenix’
Phoenix’s
Piece
Pierce
Pierce’s
Pierre
Pisonts
Pistions
Piston
Pistons
Pistons-Bulls
Pistons’
Pitching
Played
Player
Players
Playing
Playoffs
Plumlee
Poeltl
Poetl
Point
Point-forward
Points
Pondexter
Poor
Pope
Popovic
Popovich
Popovich’s
Portal
Portand
Porter
Portis
Portland
Portland’s
Porzingis
Porzingis’
Porzingus
Posting
Postseason-ending
Potential
Poter
Powell
Powell's14
Powell’s
Power
Precious
Predictably
President
Pressey
Price
Prigioni
Prince
Prior
Priority
Prized
Probably
Process
Promising
Providing
Prozingis
Pt
Puchilia
Puchulia
Pure
Pushing
Putting
Quadruple
Quality
Quciken
Questions
Quicken
Quietly
Quin
Quincy
Quite
R
R.J.
Rajon
Rakeem
Rambis
Ramon
Randal
Randall
Randle
Randle’s
Rando
Randolph
Randy
Raps
Raptor
Raptors
Raptors’
Rasaul
Rashad
Rashard
Rasual
Rather
Raul
Ray
Raymond
Reaching
Realistically
Rebounding
Receiving
Recent
Recently
Recently-named
Recently-returned
Recording
Red
Red-hot
Reddick
Reddick’s
Redick
Redick’s
Reduce
Reed
Regardless
Reggie
Regulation
Reigning
Replacing
Reserve
Reserves
Resort
Rest
Restricted
Returning
Ricahun
Richard
Richards
Richardson
Richaun
Rick
Ricky
Ridnour
Right
Rim
Rip
Rising
Rivers
Rivers’
Rob
Robbie
Roberson
Robert
Roberts
Robertson
Robertson-esque
Robin
Robinson
Rocket
Rockets
Rockets’
Rodman
Rodney
Rodriguez
Rolando
Ron
Rondae
Rondae-Hollis
Rondo
Rondo-esque
Rondo’s
Ronnie
Ronny
Rookie
Rookies
Roookie
Rose
Rose-less
Rose’s
Ross
Round
Rowan
Roy
Rozier
Rubio
Rudez
Rudy
Running
Rush
Russ
Russell
Ryan
Sabonis
Sacrament
Sacramento
Sacramento’s
Sacre
Salah
Salmons
Salt
Sam
Sampson
Samuel
San
Sanders
Saric
Sasha
Sate
Satoramsky
Satoransky
Saturday
Saturday’s
Sauce
Saunders
Save
Savings
Schroder
Schroder’s
Schroeder
Scola
Scoring
Scott
Scott’s
Scramento
Sean
Seattle
Sebastian
Second
Second-round
Second-year
Seemingly
Seems
Sefalosha’s
Sefolosha
Semaj
Semifinals
Seraphin
Serge
Sergey
Sergio
Series
Sessions
Seth
Seton
Seven
Seven-time
Several
Shabazz
Shane
Shaquille
Sharpshooter
Sharpshooting
Shaun
Shavlik
Shaw
Shawn
Shawne
Sheldon
Shelvin
Shoddy
Shooting
Shootout
Shortly
Shot
Should
Show
Shroder
Shumper
Shumpert
Shved
Siakam
Silver
Similiar
Simmons
Simply
Sims
Since
Singler
Six
Sixer
Sixers
Sixers.The
Sixers’
Sixth
Skal
Skeptics
Skiles
Skills
Slam
Slan
Sleep
Sloan
Sloan’s
Small
Smart
Smith
Smith’s
Smoothie
Snell
Snellthat
Snyder
So
Solid
Soloman
Solomon
Solutions
Some
Something
Sometimes
Somewhat
Sonny
Sophomore
Sophomores
South
Southeast
Southeastern
Southwest
Southwestern
Sox
Spaniard
Spanish
Speaking
Spearheaded
Spectrum
Speights
Spencer
Splash
Splash-Bro
Splitter
Spoelstra
Sprite
Spur
Spurs
Spurs-Lakers
Spurs-Warriors
Spurs’
Square
St.
Stalwarts
Stan
Standing
Standout
Stanley
Staple
Staples
Star
Stars
Starter
Starters
Starting
State
State-Houston
State’s
Statistics
Stats
Stauskas
Stauskus
Staying
Stepehenson
Steph
Stephen
Stephenson
Stepheson
Steve
Steven
Stevens
Stevens’
Stick
Stiffle
Stifle
Still
Storm
Stotts
Stotts’
Stoudemire
Strangely
Streaky
Strong
Struggles
Struggling
Stuckey
Sub-par
Such
Sudden
Suffering
Sullener
Sullenger
Sullinger
Summer
Sun
Sunday
Sunday’s
Suns
Suns-Kings
Sunshine
Suns’
Super
Superman-like
Supersonics
Superstar
Superstars
Support
Surprisingly
Syracuse
T
T'Wolf
T'Wolves
T-Wolves
T-Wolves’
T.
T.J
T.J.
TD
TJ
TNT
TOs
TPt
TV
TWC
Taj
Take
Taking
Talking
Target
Tarik
Taurean
Taylor
Tayshaun
Teague
Teague’s
Team
Teammate
Teams
Teauge
Teleovic
Teletovic
Telfair
Tellingly
Temple
Temple’s
Ten
Tenacity
Tennessee
Tensions
Terrance
Terrence
Terry
Texas
Th
Tha
Thabo
Thad
Thaddeus
Thankfully
Thanks
Thanksgiving
That
That’s
The
Their
Then
There
Thereafter
These
They
They’d
They’ll
They’re
They’ve
Thibodeau
Thibodeau-like
Thibs
Thing
Things
Third
Third-year
This
Thomas
Thomas’
Thompson
Thompson’s
Thomson
Thon
Thornton
Thornton’s
Those
Though
Three
Three-Point
Three-fifths
Three-point
Three-pointers
Three”
Through
Throughout
Thrust
Thunder
Thunders
Thunders’
Thunder’s
Thurday
Thurdsay
Thurdsday
Thursday
Thursday’s
Thursdsay
Thus
Thusday
Tiago
Tied
Tim
Timberwolve
Timberwolves
Timberwolves’
Timberwovles
Timbewolves
Timbwerolves
Timbwolves
Time
Times
Time”
Timofey
Timothe
Titanic
Title
To
Tobias
Together
Tolliver
Tom
Tomas
Toney
Tonight
Tony
Too
Top
Tornoto
Toronoto
Toronto
Toronto-Boston
Torontos
Toronto’s
Tough
Tournament
Tower
Tower”
Towns
Towns’
Toyota
Trade
Trail
TrailBlazers
Trailblazers
Trailing
Train
Transition
Travis
Treatment
Trevor
Trey
Trial
Triangle
Triple-double
Triple-doubles
Tristan
Triston
Troy
Truly
Trust
Tucker
Tueday
Tuesday
Tuesdays
Tuesday’s
Tunder
Tuner
Turiaf
Turkgolu
Turkoglu
Turner
Turners
Turnover
Turnovers
Turoglu
Two
Ty
Tyler
Typical
Typically
Tyreke
Tyronn
Tyson
Tyus
T’Wolves
U.S.
UCONN
UConn
UK
UNC
US
USA
Udonis
Udrih
Ulis
Ultimately
Unable
Uncharacteristic
Uncharacteristically
Under
Unfortuantely
Unfortunately
United
University
Unlike
Unsurprisingly
Up
Up-and-coming
Up-tempo
Upon
Urdih
Using
Usually
Utah
Utah’s
Utility
Valancianus
Valanciunas
Valanciunus
Valancunius
Valenciunas
Valentine
Valnciunas
Valuable
Valunciunas
Van
VanVleet
Vander
Varejao
Vasquez
Vaughn
Venloe
Verizon
Versatile
Very
Veteran
Veterans
Victor
Villanueva
Villlanueva
Vince
Virginia
Virtually
Visit
Vivint
Vivnt
Vogel
Volunteer
Vonleh
Vucevic
Vujacic
Vuvecic
W
W.
Wade
Wade’s
Waiter
Waiters
Wake
Walked
Walker
Walkers
Walker’s
Wall
Wall-led
Wall’s
Walton
Warner
Warren
Warrior
Warriors
Warriors-Suns
Warriors-Timberwolves
Warriors-esque
Warriors.Curry
Warriors’
Warriros
Was
Washington
Washington’s
Washinton
Watson
Watson’s
Way
Wayne
We
Wear
Wearing
Webber
Weber
Webster
Wednesady
Wednesay
Wednesday
Wednesday-night
Wednesdaym
Wednesday’s
Week
Weems
Well
Wells
Wendesday
Wenesday
Wes
Wesley
West
West-coast
West-leading
Westbrook
Westbrooks
Westen
Western
Western-Conference
Westrbook
Westrook
Westrook’s
What
Whats
When
Whenever
Where
Whereas
While
White
Whitehead
Whiteside
Whiteside’s
Whitesside
Wiggins
Wiggins’
Wiggins’s
Wilcox
Wildcat
Wiliams
Wilkins
Will
William
Williams
Williamses
Williams’
Willie
Willy
Wilson
Wilt
Wily
Win
Windy
Wing
Wings
Winners
Winslow
Winter
Wire-to-wire
Wisconsin
Wisconsin-born
With
Withey
Within
Without
Wittman
Wiz
Wizard
Wizards
Wizards’
Wizzards
Wolters
Wolves
World
Worst-case
Worth
Wright
Wroten
Wzll
X-factor
X-rays
Year
Year-candidate
Year’s
Yogi
York
Young
Youngster
Youngsters
Yugoslavian
Zach
Zaza
Zeller
Zeller’s
Zipser
Zipsier
Zoran
Zubac
[
]
__
``
a
ab
abbreviated
abdomen
abdominal
abductor
aberration
abilities
ability
able
ably
abnormal
abnormally
about
above
abrasion
abrupt
absence
absences
absent
absolute
absolutely
absorbed
absurd
absurdly
abundance
abundant
abuse
abused
abusing
abysmal
accelerator
acceptable
accepted
accepting
accidental
accidentally
accidently
acclimated
accolades
accompanied
accompany
accomplish
accomplished
accomplishing
accomplishment
accomplishments
according
accordingly
account
accounted
accounting
accrue
accrued
accruing
acculturated
accummulating
accumualted
accumulate
accumulated
accumulating
accuracy
accurate
accurately
accustomed
acheived
achievable
achieve
achieved
achievement
achievements
achieving
achilles
aching
acquire
acquired
acquiring
acquisition
acquisitions
acquitted
acrobatic
across
act
acted
action
actions
active
activities
actual
actually
ad
adage
adapating
add
addding
added
adding
addition
additional
additionally
additions
addressed
adds
adductor
adequate
adequately
adhere
adjust
adjusted
adjustment
adjustments
admirable
admirably
admitted
admittedly
admitting
adopt
adopted
adouble
aductor
advanatage
advance
advanced
advances
advancing
advantage
advantageous
advantages
advatage
adversaries
adversity
advised
affair
affairs
affect
affected
affecting
affectionately
affects
afflict
afflicted
afford
afforded
afire
afloat
aforemented
aforementioned
aformentioned
afraid
after
afternoon
afternoons
again
against
aganist
age
ageless
agency
agent
agents
ages
age”
aggravated
aggravating
aggressive
aggressively
aggressiveness
agile
aging
ago
agree
agreed
agressive
ahead
ahlf
ahold
aid
aided
aiding
ailed
ailing
ailment
ailments
aim
aiming
air
airball
airing
alarming
alarmingly
albeit
alertly
aligned
alike
alive
all
allegedly
allergic
alleviate
alley
allotment
allow
allowed
allowing
allows
almost
alone
alones
along
alongside
already
also
alter
altercation
altered
alternate
alternated
alternating
alternative
although
altitude
altitude.Toronto
altogether
alum
alumni
always
amass
amassed
amassing
amazing
amazingly
ambush
ambushed
ambushing
amends
amid
amidst
amigo
amiss
ammunition
among
amongst
amount
amounted
amped
ample
an
analysts
anchor
anchored
anchoring
and
andAllen
anemic
anger
angry
anguish
animal
ankle
ankles
annihilated
announced
announcement
annual
anomalous
another
ans
answer
answered
answers
antagonizing
anti
anticipated
anticipation
antics
anxious
any
anybody
anyhow
anymore
anyone
anyones
anything
anytime
anyway
anywhere
apart
apiece
apparent
apparently
appealing
appear
appearance
appearances
appeared
appearing
appears
appeased
appendectomy
applied
apply
appreciate
apprehension
apprentice
approach
approached
approaching
appropriately
approval
approximately
approximating
aptly
aquired
arc
arch
arcing
are
area
areas
arena
arenas
aren’t
arguably
argue
argued
arguing
argument
arises
arm
armor
arms
army
around
array
arrested
arrival
arrives
arriving
arsenal
arsenals
arthroscopic
artillery
as
ascend
ascended
ascending
ashamed
aside
asissted
asists
ask
asked
asking
aspect
aspects
aspirations
aspire
aspiring
assert
asserted
asserting
assessed
asset
assets
assignment
assissts
assist
assistance
assisted
assisting
assists
assits
associated
association
assorted
assortment
asssists
asssits
assuage
assuaged
assume
assumed
assure
assured
asterisk
astonishing
astounding
astoundingly
astronomical
at
atToyota
athletic
athleticism
atmosphere
ato
atoned
atop
atrocious
attack
attacked
attacking
attacks
attain
attained
attaining
attempt
attempted
attempting
attempts
attend
attendance
attended
attention
attitude
attributed
atypical
atypically
audible
audiences
augmented
auspicious
automatic
automatically
avail
availability
available
avenge
avenged
average
averaged
averages
averaging
averaing
avert
averted
avoid
avoided
avoiding
await
awaited
awaiting
awaits
awaken
award
awarded
awards
aware
awareness
away
awe
awful
awhile
awkward
awkwardly
awoke
awry
a”
back
back/calf
backboard
backboards
backbone
backcourt
backcourts
backdoor
backed
backfired
backhand
backing
backourt
backs
backseat
backside
backup
backups
bad
badly
baffling
bag
bail
bailed
bailing
balance
balanced
ball
balled
ballgame
ballhandler
ballhandlers
ballhandling
balling
ballistic
ballooned
balls
banana
bananas
band
banded
bang
banged
banished
bank
banked
banker
banking
banks
banter
bar
barbecue
barely
bargain
bargained
barley
barn
barrage
barrel
barreled
barrier
based
baseline
basic
basically
basis
basket
basketball
baskets
battered
battle
battled
battles
battling
bay
be
beam
beanch
bear
beard
bears
beast
beasted
beastly
beat
beatable
beatdown
beaten
beater
beating
beautiful
beautifully
beauty
became
because
become
becomes
becoming
becomming
bedrock
been
befell
befitting
before
beforehand
began
begging
begin
beginning
begins
begun
behalf
behavior
behind
being
beleaguered
belied
beliefs
belies
believable
believe
believed
believes
belittling
bell
belonged
below
belt
bench
benched
benches
benching
benchmark
benchwarmers
bend
beneath
benefactor
beneficial
beneficiaries
beneficiary
benefit
benefited
benefiting
benefits
benefitted
berth
besides
besieged
best
bested
besting
bests
bet
bets
better
between
bevvy
bevy
beyond
bid
big
bigger
biggest
bigman
bigs
bilateral
billing
bind
birth
birthday
births
bit
bite
biter
biting
bitten
bitter
bittersweet
bizarre
black
blame
blamed
blank
blanked
blasted
blazing
bleak
bleaker
bleakness
bled
bleed
bleeding
blemish
blessing
blew
blinding
blink
blip
blister
blistering
blitz
blitzed
blitzing
blizzard
block
blocked
blocker
blockers
blocking
blocks
blood
blooded
blossom
blossoming
blow
blowing
blown
blowout
blowouts
blows
blue
blueprints
blurred
board
boards
boars
boast
boasted
boasting
boastly
boasts
bode
bodes
bodies
body
boggling
boiled
boiling
bold
bolster
bolstered
bolstering
bomb
bonanza
bone
bonkers
bonus
booing
book
books
boom
booming
boos
boost
boosted
booster
boosting
boosts
boot
booted
booth
border
borderline
borough
boss
both
bother
bothered
bothering
bothersome
bottled
bottom
bottomed
bounce
bounceback
bounced
bouncing
bound
bounded
bounds
bout
bowed
bowing
bowtie
box
boxed
braced
brand
brass
bread
break
breakaway
breakdowns
breaker
breaking
breakneck
breakout
breaks
breath
breathe
breathed
breathing
breeds
breeze
breezed
brewing
bricked
bricks
brief
briefly
brigade
bright
brighter
brightest
brightly
brilliance
brilliant
brilliantly
bring
bringing
brings
brining
brink
broad
broadcast
broadcasts
broke
broken
brother
brothers
brought
brouhaha
bruise
bruised
bruises
brunt
brush
brushed
brutal
brutally
bubble
buck
bucked
bucket
buckets
buckle
buckled
bucks
budding
buffer
bug
bugaboo
bugs
build
builder
building
builds
built
bulk
bulldog
bullet
bullets
bullied
bullk
bully
bullying
bump
bumped
bumping
bumps
bumpy
bunch
bunched
bunches
buoyed
burden
buried
burn
burned
burner
burning
burnt
burst
bursts
bury
burying
bus
busiest
busines
business
bust
busted
buster
busting
busy
but
butter
butting
button
buy
buzz
buzzer
buzzing
by
byeond
bygone
byproduct
ca
cacophony
cake
calamity
calendar
calf
caliber
calibur
call
called
calling
calls
callup
calm
came
camera
camp
campaign
campaigning
campaigns
can
can't
cancellation
cancelled
candidate
candidates
candle
cane
canned
canning
can’t
cap
capabilities
capability
capable
capacity
capital
capitalize
capitalized
capitalizing
capped
capping
caps
capture
captured
capturing
card
care
careened
careening
career
careers
careful
carefully
careless
carelessness
carried
carries
carry
carrying
carted
carve
carving
case
cased
cash
cashed
cashing
cast
casualty
catalyst
catapulted
catastrophic
catch
catches
catching
categories
category
caught
cause
caused
causing
caution
cautious
cavalcade
caved
ccaught
cede
ceded
ceding
celebrate
celebrated
celebrates
celebrating
celebration
celebrations
cellar
cement
cemented
cements
center
centered
centerpiece
centers
center’s
central
centric
century
ceremony
certain
certainly
chair
chairs
chalk
challenge
challenged
challenging
champ
champion
champions
championship
championships
champs
chance
chances
change
changed
changer
changes
changing
changts
channel
channeled
chanted
chants
chaos
chaotic
character
characteristic
characteristically
characters
charge
charged
charges
charging
charity
chart
chase
chased
chasing
chasm
chatter
check
checked
checking
cheer
cheers
chemistry
cherry
chest
chief
child
childhood
chimed
chip
chipped
chipping
chippy
chips
choice
choices
choke
choked
chokes
choking
chorus
chose
chosen
chuck
chucked
chucking
chugging
chunk
chunks
churned
churning
cigar
circle
circled
circles
circuit
circulating
circumstance
circumstances
circus
cited
city
claim
claimed
claiming
clammoring
clamp
clamped
clamping
clamps
clapping
clash
clashed
class
classic
claw
clawed
clawing
clean
cleaned
cleanest
cleanly
clear
cleared
clearer
clearing
clearly
clerical
click
clicked
clicking
clicks
climactic
climb
climbed
climbing
clinch
clinched
clincher
clinching
clinging
clinic
clinics
clip
clock
clocked
clocking
clogging
close
closed
closely
closer
closest
closing
clot
clots
clouded
club
clubs
clue
clung
clunky
clustered
clutch
clutched
clutching
co
coach
coached
coaches
coaching
coast
coasted
coaster
coasting
coattails
coaxed
coaxing
cobbled
cobwebs
coffin
cog
cognizant
cogs
cohesion
cohesive
coin
coincided
coincidence
coincidentally
coincidently
coinciding
cold
coldest
collapse
collapsed
collapses
collapsing
collar
collarbone
collect
collected
collecting
collection
collective
collectively
college
collided
colliding
collision
colors
column
columns
combat
combed
combination
combinations
combinded
combine
combined
combing
combining
combo
come
comeback
comebacks
comenack
comes
comfort
comfortable
comfortably
coming
comission
comitted
command
commanded
commanding
commence
commencing
commendable
commended
comment
commentator
commentators
commenting
comments
commission
commissioner
commit
commited
commiting
commitment
commits
committed
committee
committing
commmitted
common
commonplace
communication
commuted
company
compared
compares
comparing
comparison
compatriot
compatriots
compensate
compensated
compensating
compete
competed
competes
competetive
competing
competition
competitions
competitive
competitively
competitiveness
competitor
competitors
compile
compiled
compiling
complained
complement
complementary
complemented
complementing
complete
completed
completely
completing
completion
complications
compliment
complimented
component
components
composed
composure
compounded
comprised
conceded
conceivably
concept
concern
concerned
concerning
concerns
concerted
conclude
concluded
concludes
concluding
conclusion
concussed
concussion
condemning
condition
conditioning
conduct
conested
conference
conferences
confidence
confidence.The
confident
confidently
configuration
confined
confines
confirm
confirmed
confirming
confounded
confrontation
confused
confusing
coninued
conjunction
conjure
connect
connected
connecting
conquer
conquered
consectuive
consecutive
consequence
consequently
conservatism
consider
considerable
considerably
consideration
considered
considering
consisted
consistency
consistent
consistently
consisting
constant
constantly
contact
contagious
contain
contained
containing
contast
contemplating
contempt
contend
contended
contender
contenders
contending
contention
contest
contested
contesting
contests
context
contines
contingent
continually
continuation
continue
continued
continues
continuing
continuous
continuously
contract
contracts
contrary
contrast
contrasted
contrasting
contribute
contributed
contributes
contributing
contribution
contributions
contributor
contributors
contributuing
control
controlled
controlling
controversial
controversy
controvsial
contusion
convene
conversation
conversely
conversion
convert
converted
converting
conveting
convey
convincing
convincingly
cookie
cooking
cool
cooled
cooler
cope
cord
core
cornea
corneal
corner
corners
cornerstone
cornerstones
corps
corral
corralled
correct
correlates
correlation
corresponding
cost
costed
costing
costly
coughed
coughing
could
couldnt
couldn’t
count
counted
counter
counteract
countered
countering
counterpart
counterparts
counting
countless
country
couple
coupled
course
court
courtesy
courth
courts
courtside
cover
covered
covering
coverting
covertly
covet
coveted
crack
cracked
cracking
craftier
craftmanship
crafty
cramps
cranial
crash
crashed
crashing
crawl
crawled
crawling
crazy
create
created
creating
creation
creative
creativity
credit
credited
creep
creeping
crept
crescendo
crew
crime
crisis
crisp
critical
criticism
criticized
critics
crooked
cross
crossed
crossover
crosstown
crowd
crowded
crown
crowned
crucial
cruel
cruise
cruised
cruising
crumbled
crumbling
crunch
crushed
crushing
crux
cry
cuff
culiminated
culled
culminated
culminating
culprit
culprits
cultivated
culture
cumulative
cup
curator
cure
curious
curiously
currenly
current
currently
curse
cursing
curtailed
curve
curveballs
cushion
cusp
customarily
customary
cut
cuts
cutters
cutting
cylinder
cylinders
cyllinders
cyst
dagger
daggered
daggers
damage
damaging
dampening
dampens
damper
dance
danced
danger
dangerous
dark
darkhorse
darlings
darted
dashed
date
dating
daunting
day
daylight
days
dazzled
dck
de
deactivation
dead
deadeye
deadliest
deadline
deadlock
deadlocked
deadly
deal
dealing
dealings
deals
dealt
dearth
death
debacle
debate
debilatated
debut
debuted
debuting
debuts
decade
decades
deceiving
decent
decide
decided
decidedly
deciding
decimate
decimated
decimating
decimation
decipher
decision
decisions
decisive
decisively
deck
declared
decline
deemed
deems
deep
deeper
deepest
defacto
defeat
defeated
defeating
defeatist
defeats
defend
defended
defender
defenders
defending
defeneder
defense
defenses
defensive
defensively
defensvie
defer
deferment
deferred
deferring
deffense
deficiencies
deficiency
deficit
deficits
defining
definite
definitely
definition
definitive
definitively
deflated
deflating
deflect
deflected
deflection
deft
defy
degree
degrees
delay
delayed
delaying
delight
deliver
delivered
delivering
demise
demolish
demolished
demonsrated
demonstrated
demonstrates
demonstrating
demoralized
demoralizing
demoted
demotion
denied
dent
dented
denver
deny
depart
departed
departing
department
departments
departure
departures
depend
dependable
depended
dependent
depending
depleted
deplorable
deploy
deployed
deploying
depravity
depressing
depth
depths
derail
derailed
derailing
derided
describe
deserve
deserved
deserves
deserving
designated
designation
designs
desire
desired
despair
desparate
desperate
desperately
desperation
despite
destined
destiny
destroy
destroyed
destroying
deter
deteriorated
determine
determined
determing
determining
deterred
deterrent
dethrone
detract
detrimental
devastated
devastating
develop
developed
developing
development
developments
devestating
deviation
devoid
dfive
diagnosed
diagnosis
dial
dialed
diamond
dice
diced
dictate
dictated
did
did'nt
didnt
didn’t
die
died
differ
difference
differences
different
differential
differentials
differentiate
differently
differing
difficult
difficulties
difficulty
dig
digging
digit
digits
digs
dilluted
dim
dime
dimes
diminished
diminishing
diminutive
din
dip
dipped
dips
dire
direct
directed
direction
directions
directly
dirty
disadvantage
disadvantaged
disadvantages
disagreed
disallowed
disallowing
disapointing
disappeared
disappearing
disappoint
disappointed
disappointing
disappointingly
disappointment
disappointments
disapproval
disarray
disaster
disastrous
disbelief
disciplinary
discipline
disciplined
discomfort
discouraged
discovered
discrepancies
discrepancy
discuss
discussed
discussion
disdain
disgraceful
disgruntled
disguise
dish
disheartened
disheartening
dished
disheveled
dishing
disinterested
dislocated
dislocating
dislocation
dismal
dismantled
dismantling
disparities
disparity
dispatch
dispatched
dispatching
displaced
display
displayed
displaying
displeasure
disposal
disposed
disproven
disqualified
disrupt
disrupted
disruption
dissapoint
dissapointed
dissapointing
dissecting
dissimilar
dissipated
dissipating
dissuade
distance
distanced
distancing
distant
distinct
distinction
distinguished
distress
distribute
distributed
distributes
distributing
distribution
distributions
distributor
distributors
disturbances
disturbing
ditch
diverse
divide
divided
dividends
diving
division
divisional
do
dobule
docket
dockett
doctor
doctors
documented
dodged
does
doesn’t
dog
dogfight
dogged
dogs
doing
doldrums
doled
doling
dollar
domain
domianted
dominance
dominant
dominantly
dominate
dominated
dominates
dominating
domination
domincance
domino
don't
done
donning
don’t
doom
doomed
dooming
door
dose
doses
doubble
doube
double
double.Tyler
doubled
doubles
doubling
doubly
doubt
doubters
doubtful
doubting
doubts
dougle
dove
down
downcourt
downed
downfall
downgrade
downhill
downplays
downright
downs
downside
downtown
downturn
downward
downwards
draft
drafted
drafting
drafts
drag
dragged
drain
drained
draining
drama
dramatic
dramatically
drastic
drastically
draw
drawing
drawn
draws
dreadful
dreadfully
dream
dreams
dressed
dressing
drew
dribble
dribbled
dribbling
drill
drilled
drilling
drive
drived
driven
driver
drivers
driving
drop
dropoff
dropped
dropping
droppped
drops
drought
droughts
drove
droves
drowned
drubbing
drug
dry
du
dubious
dubiously
dud
duds
due
duel
dueled
dueling
dug
duked
dull
dumped
duncan
dunk
dunked
dunking
dunks
duo
duos
duplicate
duplicating
duration
during
dust
duties
duty
dwellers
dwindle
dwindled
dwindling
dying
dynamic
dysfunctional
each
eager
eaked
ear
earlier
earliest
early
earmarked
earn
earned
earnest
earnestly
earning
earns
earth
ease
eased
eases
easier
easiest
easily
easing
east
eastern
easy
eat
eating
ebbs
ecipsed
eclipse
eclipsed
eclipsing
ecstatic
edge
edged
edging
edgy
eek
eeked
effecient
effecive
effect
effected
effective
effectively
effectiveness
effects
efficacy
efficiency
efficient
efficiently
effort
effortless
efforts
efforts.Frank
egardless
egg
egregious
eight
eighteen
eighteenth
eighth
eights
eigth
either
ejected
ejection
eking
elated
elbow
elbowed
elbowing
elder
elders
elecrtic
elected
election
electric
electrifying
elegant
element
elevated
eleven
eleventh
elicit
elicited
eliciting
elicted
elicting
eliminate
eliminated
eliminates
eliminating
elimination
elite
elixir
elixirs
elminated
else
elsewhere
elusive
emanated
emanating
embarassing
embarassment
embark
embarked
embarking
embarks
embarrassed
embarrassing
embarrassingly
embody
embrace
embraced
emerge
emerged
emergence
emerging
emotional
emphasis
emphasize
emphasized
emphasizes
emphatic
employ
employed
employee
employer
employing
emptied
empty
en
enabled
enbaled
encompassing
encore
encounter
encountered
encouraged
encouraging
encouragingly
end
endeavors
ended
ending
endless
ends
endure
endured
enduring
enemy
energetic
energized
energizer
energizing
energy
engage
engaged
engaging
engine
enhanced
enigma
enigmatic
enjoy
enjoyed
enjoying
enmity
enormous
enough
ensue
ensued
ensuing
ensure
ensured
ensuring
enter
entered
entering
enters
entertain
entertaining
entertainment
entire
entirely
entirety
entrance
entrenched
entry
envious
environment
environments
envisioned
epic
epitomized
equal
equaled
equaling
equalizer
equally
equation
equipment
equipped
era
eradicated
erase
erased
erasing
err
errant
erroneous
error
errors
erupted
erupting
eruption
escalated
escape
escaped
escaping
escorted
espcially
especially
esque
essential
essentially
establish
established
establishing
euro
eurostep
evaluated
evaluating
evaluation
evaporate
evaporated
evaporation
eve
even
evened
evening
evenly
event
eventful
events
eventual
eventually
ever
every
everybody
everyone
everyones
everything
everywhere
evidence
evidenced
evident
eviscerated
eviscerating
evisceration
ex
exacerbated
exact
exacted
exactly
examination
examining
example
exceed
exceeded
exceeding
exceedingly
exceeds
excel
excelled
excellence
excellent
excelling
except
exception
exceptional
exceptionally
exceptions
exchange
exchanged
exchanges
exchanging
excited
excitement
exciting
exclamation
exclude
excluding
exclusively
excruciating
excursion
excuse
execute
executed
execution
exemplary
exemplified
exemplifies
exemplifying
exercised
exercising
exert
exerting
exhausted
exhausting
exhaustion
exhibited
exhibiting
exhibition
exhibtion
exhilirating
existent
existing
exit
exited
exiting
exits
